bad
worst
great
waste
awful
excellent
best
boring
terrible
wonderful
nothing
stupid
poor
perfect
poorly
worse
no
love
amazing
horrible
minutes
supposed
well
dull
lame
wasted
script
loved
plot
favorite
superb
brilliant
must_see
fails
also
annoying
crap
why
very
life
highly
still
mess
beautiful
at_all
fun
ridiculous
avoid
unfortunately
disappointing
enjoyed
fantastic
today
instead
disappointment
just
definitely
well_worth
even
good
laughable
oh
pointless
always
will
gem
both
not_worth
beautifully
money
10_10
pathetic
hilarious
enjoyable
cheap
badly
unless
save
acting
would
redeeming
especially
not_even
who
not_funny
it's
years
sorry
only
attempt
wonderfully
at_best
if
strong
perfectly
different
any
makes
refreshing
masterpiece
own
unfunny
original
most
weak
could_been
predictable
mediocre
very_well
forgettable
couldn't
not_good
seen
powerful
classic
world
or
least
performances
subtle
true
entertaining
guess
more
heart
sit_through
dvd
from
touching
solid
awesome
definitely_worth
funniest
by
better
job
unique
thing
problem
simple
dreadful
silly
incredible
lacks
wooden
can
greatest
bit
tedious
garbage
ever
recommend
so
looks
on_dvd
see
war
not_very
half
many
ok
terrific
disappointed
off
not_recommend
realistic
recommended
shows
to_be
other
book
may_not
films
enjoy
liked
surprised
lives
didn't
mst3k
think
bland
no_sense
so_bad
may
outstanding
performance
like
okay
finest
idea
reason
about
to_make
first_time
lousy
would_been
trying
way_too
out
someone
could
pretentious
delightful
bother
look_like
there
when
amateurish
time
later
series
freedom
decent
rare
either
rubbish
bored
mildly
up
anything
only_good
skip
apparently
uninteresting
do
though
lot
highly_recommend
be_disappointed
stinker
miscast
director
low
failed
very_funny
had
unwatchable
some
much
grade_d
sucks
very_disappointed
human
noir
unexpected
top_notch
dumb
underrated
don't
story
those
first_saw
first
which
pleasantly_surprised
gives
wasn't
because
episode
hoping
none
than
moving
horror
neither
works
seemed
what_makes
too
to_recommend
very_good
should
them
what
man
stunning
looked
wanted_to_like
point
moment
way
intense
better_than
brilliantly
sometimes
insult
quite
at_first
flat
worth
family
loved_movie
sweet
been
at_times
to_avoid
effort
much_better
did
often
fascinating
unbelievable
as_if
new
embarrassing
10_out_10
surprisingly
young
extraordinary
had_high
wasting
lack
feel
easy
believable
seems
turkey
being
favourite
uninspired
i'm
might
painful
fast_forward
just_didn't
watchable
really
watch
cover
hours_life
below_average
unlike
people
great_movie
make
overall
against
does
well_done
captures
made
looks_like
highly_recommended
nice
into
get
just_not
excuse
emotions
unconvincing
beauty
alright
where
live
treat
two
each
potential
incoherent
funny
wrong
times
real
doesn't
credibility
remotely
barely
if_want
john
journey
joke
tells
edge
ending
plays
these
too_many
bunch
bad_thing
remarkable
stupid_but
watching
unintentionally
writing
after
can't_wait
together
right
part
basically
complex
obvious
to_see_again
again
then
unforgettable
there's
embarrassed
been_great
city
last
obnoxious
at_time
that's_about
character
maybe
not_recommended
isn't
rip_off
predictable_but
ashamed
trash
or_something
wouldn't_recommend
atmosphere
not_enough
scene
while
shallow
just_isn't
down
looking
day
absolutely_no
mystery_science
entire
seagal
if_must
however
i'm_afraid
whatsoever
movies
propaganda
music
don't_miss
more_entertaining
show
perfect_example
surprise
characters
tripe
how
far_too
little_to
flawless
little
plenty
not_very_good
only_problem
budget
want_to
something
waste_time
premise
doesn't_work
enough
twists
say
oscar
chance
wonder
drivel
not_disappointed
sex
expecting
sadly
back
know
tiresome
genius
hooked
yet
scenes
keep
course
never
wife
trite
am
another
to_see
small
very_little
far
stay_away
couple
asleep
through
tried
just_right
bad_movie
between
over
worst_movie
in_grave
actors
main
can't_recommend
probably
haunting
gritty
memorable
truly
everyone
effective
felt
others
yawn
few
pretty_good
would_be
first_rate
laugh
ways
experience
here
every
saw
can_see
certainly
value
movie_just
pleasure
that's
nicely
moments
material
might_enjoy
style
thin
deserves
paint
back_in
be_good
if_want_to
chilling
endless
pretty
look
impressed
should_been
dimensional
now
any_characters
it's_just
suppose
appreciate
yes
appreciated
else
not_bad
nowhere
hell
otherwise
murder
comedy
action
did_not
although
wouldn't
despite
night
thanks
not_only
would_love_to
to_all
offensive
exceptional
performance_as
if_don't
as_much
10
boring_but
nevertheless
supposed_to
in_film
police
die
available
put
version
may_be
subtitles
end
very_entertaining
he's
go
worthless
find
friendship
as_well_as
guy
season
10_out
adds
rest
even_better
top
thumbs_up
if_don't_like
great_job
sinatra
liked_movie
american
but_it's
no_other
to_find
mean
in_city
superbly
attempt_at
stupidity
before
score
case
i'd
short
left
tears
doesn't_make
love_movie
boredom
without
death
if_had
douglas
eerie
atrocious
make_fun
give
women
low_budget
along
br_sound
read_book
interesting
as_well
played
let's
looks_at
become
not_be
mind
married
fine
ordinary
once
in_way
tale
best_part
long
things
portrayal
unusual
what_point
complaint
only_reason
good_as
there_no
care
fact_that
sequel
feelings
should_never
bore
i've
believe
nature
completely
definitely_not
appalling
robert
doing
work
supposed_to_be
days
cinema
humor
at_end
come
clich<U+00E9>
seeing
thought
men
creepy
well_written
almost
ludicrous
just_doesn't
not_much
scientist
crappy
release
ruined
vhs
moves
that_would
hollywood
very_bad
accent
lots
message
theme
place
more_enjoyable
unintentional
helps
in_movie
sucked
isn't_even
jean
looking_forward
more_like
only_complaint
came
victims
storyline
want
tragic
dead
be_missed
lugosi
what_thinking
interesting_but
episodes
next
b
minutes_life
bravo
sort
need
to_save
roles
such
wrote
animal
role
disaster
dialogue
ever_seen
hour
paid
read
at_least
late
olds
film_that
remake
only_saving
to_watch
caught
little_film
remember
courage
writers
on_on
problem_with
raped
thought_provoking
gun
violence
contains
d
sequences
except
able_to
producers
three
ugly
get_bored
found
wanted_to
can_relate
or_worse
big
fast_paced
going
there_some_good
outer_space
tolerable
sense
promising
shot
don't_think
jack
star
come_on
copy
those_who
shots
favorites
but_not
child
same
soap
had_to
keeps
tv
inept
crime
actually
up_with
christian
might_been
woman
until
edge_seat
relationship
paper
white
ride
takes_place
norris
seconds
amazing_that
falls
camera
obviously
br_in
tired
take
utter
who's
idiotic
grade
up_in
confusing
putting
gets
dreams
fan
special
film_in
to_original
today's
below
around
slow_moving
must
be_funny
lines
would_recommend
insult_to
town
but_still
mr
synopsis
viewing
takes
tries
questions
perfection
same_time
can't
got
images
isn't_very
lot_fun
cast
cardboard
might_not
saving
hand
fans
not_believable
be_comedy
on_edge_seat
using
easily
will_not
compelling
quickly
brain
hope
moved
to_some
ill
but_if
rather
animation
appears
killer
sad
history
girl
honestly
junk
see_again
useless
irritating
just_great
appeal
walked_out
done
s
as_to
be_entertaining
knowing
similar
future
english
everything
fake
reality
but_did
effects
charming
incredibly
across
throughout
hard_to
to_say
trying_to
makers
became
old
watched
van
movie_that
actress
even_though
sub_par
you're
year
fact
major
game
in_lives
to_work_with
to_do
bad_at_all
said_that
existent
set
well_as
college
having
beginning
don't_even
begins_with
won't
mess_with
skill
kind
mother
80_s
will_be
called
jason
anyone
sound
says
how_not_to
favorite_movies
script_by
making
as_long
near
to_get
seriously
friends
picture
consequences
disney
can_be
audience
br_if
all_in
mention
society
reason_to
somewhat
br_br_must
interest
not_make
missing
rent
refuses_to
understand
boss
tell
most_people
let_down
franchise
they're
silent
delivers
with_film
nothing_to
doesn't_help
stars
mason
who_likes
entertaining_but
becomes
more_than
would_like_to
sadistic
opinion
raw
living
snow
elements
no_matter
bad_about
according
stock_footage
acted
sensitive
saw_film
anyway
upon
good_movie
whole
happens
goes
evil
pleasant
insulting
overall_good
shelf
soon
guys
bothered_to
inappropriate
gore
revenge
holds
killed
pleasantly
but_that
saying
fears
walking_around
aren't
scene_in
not_that
satisfying
wrapped_up
second
going_to
what's
social
porn
to_capture
saw_movie
expected
good_time
compared
there_some
horror_film
entertainment
comic
monster
gorgeous
unlikeable
law
many_people
be_worth
warm
necessary
help
in_first
husband
christians
beginning_to
produced
may_seem
mrs
shown
watch_over
hype
started
comes
or_at
lacking
real_life
appears_to
led
if_you're
then_will
french
full
western
troubled
stick_to
sit_back
br_all_in_all
glad
reminds
bad_guy
opening
children
abandoned
none_less
several_times
harry
play
art
unremarkable
absorbing
generous
on_imdb
clear
disgusting
latter
home
novels
dirty_harry
created
edited
sure
which_not
off_as
but_just
realizes
itself
high
hackneyed
in_fact
familiar
such_as
sees
attention
lovely
better_or
film's
actor_in
seem
lifeless
video
great_as
7.5
br_br_but
do_not
would've
cameo
stilted
magnificent
or_even
deliciously
pure
business
bond
female
leaves
to_believe
manages_to
if_not
more_movies
hollow
as_good
seen_in
redemption
gave
jews
tries_to_be
epic
elaborate
but_also
pass
ends
blah
playing
steals_show
supposedly
cold
forget
won't_be
line
that_most
pull_off
don't_want
usually
thank
should_see
excellently
dance
escape
head
semi
wanted
hard
from_being
important
thumbs_down
running
sexy
thinking
let
genre
main_character
focus
since
i've_seen
irish
run
drama
taken
cinematography
how_good
than_any
space
decides_to
black
to_sit_through
man_who
soundtrack
feel_that
steals
bad_reviews
driving
check
famous
i'm_not
behavior
change
worth_watching
stop
hero
highly_entertaining
frame
in_real_life
sexual
power
total
following
across_as
used
side
movie_with
that_make
happened
parents
really_good
fantasy
intended
just_to
to_help
act
talking
some_good
you'll
screen
apartment
don't_take
system
project
that_film
not_to
decided_to
loving
brought
eventually
slow
unrealistic
third
lynn
seemed_like
released
indeed
in_that
that_movie
say_that
torture
shows_up
so_well
final
be_great
whenever
huge
must_be
cut
in_face
rich
male
criminal
over_top
br_however
perhaps
re
away_from
blame
60
seems_to
on_earth
scene_where
offer
care_about
exception
make_up
son
some_kind
screenwriter
faced
hidden
camp
credit
brother
key
to_cover
feeling
ultimate
taste
miserably
as_good_as
company
then_again
girlfriend
see_that
to_be_good
flick
parts
simply
zombie
not_in
follows
known
during
sharp
it's_not
not_really
not_as
dismiss
less
turkish
laughing
other_things
so_much
presence
exciting
all_but
to_survive
reasonably
everyone_else
all_would
ms
great_film
drags
made_movie
towards
david
disappoint
content
said
baldwin
make_movie
bothered
decades
wars
excellent_film
decided
tried_to
bad_movies
hiding
to_think
alive
really_bad
marvelous
but_there
watched_movie
hope_that
out_to
never_get
with_some
hit
order
begins_to
four
like_in
so_good
ever_since
she's
particular
control
but_good
boll
much_as
nude
black_white
delicious
whether
stands
personally
potential_but
only_thing
try
blood
better_job
film_shows
played_by
herself
ruins
let's_see
numbers
heard
giving
officer
albeit
etc_etc
environment
make_any
sitting
away
know_who
who_liked
too_much
simplicity
frank
if_want_to_see
mickey
much_like
production
absolutely_nothing
continuity
no_matter_what
at_same_time
hate
million
hurt
wish
grade_b
alone
thought_that
new_york
grab
cash_in
don't_know
concept
deliver
just_wasn't
form
sets
seems_to_be
very_interesting
how_many
else_to
see_movie
at_each
self
imagine
why_did
cheesy
tells_story
rape
aspect
that_main
fun_at
feature
italian
truth
extremely
surprising
like_watching
deep
riveting
put_off
difference
deal_with
father
horribly
how_not
eyes
not_typical
spectacular
attempts_to
engaging
part_movie
doesn't_even
cried
life_but
happy
sisters
feels
stereotyped
hands
think_it's
also_good
expect
nearly
painfully
i'll
forced
downhill
pleased
totally
wondering
tense
elsewhere
suggest
word
repetitive
makes_even
nudity
get_to
don't_get
br_as
br_br_all
enough_to_save
in_final
admit
innocent
work_art
earth
dialog
br_br_if_want
river
opportunity
none_other_than
little_more
dreck
hear
type
hot
vehicle
lacked
tries_to
out_on
rating
but_to
context
coming
deals_with
actual
to_dvd
walking
surprisingly_good
strange
crew
romance
directors
embarrassment
barbara_stanwyck
closet
filled
fell_asleep
to_let
offers
jamie
becoming
on_fire
go_on
history_br_br
catch
can_watch
psychedelic
absolutely
seat
special_effects
rented
means
fellow
ed_wood
with_little
clich<U+00E9>d
touched
actors_but
how_bad
write
b_movie
in_mind
meets
most_boring
anymore
disappointed_that
them_to
just_too
unnecessary
toilet
something_better
films_that
could_be
group
good_idea
amusing
glass
blown_up
above
view
name
travesty
or_not
doubt
out_10
dies
london
shame_because
students
crafted
ripped
prince
than_original
every_time_watch
screaming
that_could
chief
certain
filmed
dan
work_in
nonsense
facial
evidence
horror_films
at_same
with_two
to_come
90_minutes
two_hours
but_like
deeper
fault
mother's
much_better_than
early
war_that
but_in
speech
five
worst_movies
story_told
deal
bill
p.s
therefore
background
matter
br_br_why
not_br_br
too_hard
flimsy
but_not_much
impossible
as_bad
really_like
rock
room
email
looked_like
tremendous
written
that_actually
br_like
british
based_on_true_story
among
comedies
best_film
chris
somewhere
mean_that
student
only_good_thing
joy_to
forever
succeeds
facts
younger
talk
large
back_to
driven
fresh
as_movie
there_also
that_it's
you'll_be
knew
remember_seeing
don't_recommend
to_know
nowadays
but_be
br_so_what
fun_in
in_addition_to
bin
15
biggest
few_laughs
spoilers
way_that
lonely
typically
ultimately
multi
or_two
no_real
critics
but_script
then_movie
that_some
to_do_with
went
facing
no_chemistry
film_about
than_movie
spot_on
br_also
eye
leads
it's_also
edward
than_expected
turning
footage
strength
bush
entirely
present
just_enjoy
or_funny
kill
photography
impressive
but_what
star_wars
can't_believe
complete
in_most
definitely_recommend
miracle
example
now_with
way_out
similar_to
good_to
depressing
couple_hours
doctor
subject
that_time
feels_like
dying
hunter
already
we're
barbara
picks
scene_which
from_start_to_finish
as_far_as
manager
integrity
in_love
to_in
big_screen
animated
i'm_glad
whatever
seem_to
nut
lesson
just_because
see_any
add
to_take
without_being
killers
girls
team
bad_guys
friend
bad_things
moment_in
expectations
that_great
fighting
in_middle
standard
dr
based_on
be_quite
so_many
amounts
think_that
45
eleanor
no_idea_what
guy_who
depth
but_could
reading
portrayed
earlier
members
took
to_get_to
books
general
thanks_to
or_hate
horror_flick
does_not
learn
jake
aged
br_some
nice_to
leading
jerry
put_on
all_together
previous
to_forget
2000
in_many
largely
likable
standards
surely
movie_but
failure
generally
anti
don't_like
jokes
contrast
in_early
things_that
movie_about
next_to
torn
most_part
plot_but
creating
start
mob
possible
events
due
fall_in_love_with
or_may_not
channel
up_to
unintentionally_hilarious
film_just
hours
too_br_br
people_who
entertainment_value
mood
when_it's
montage
americans
onto
person
little_movie
time_to
hardly
lost
dream
writer
isn't_that
can_never
in_order
intelligent
connection
had_no_idea
singers
desperately
to_give
begins
shame
got_to_see
suffers
to_talk
what_most
sheep
less_than
folks
70_s
career
sucked_into
hey
if_like
how_to
direction
laughs
weren't
told
heroes
audiences
viewer_to
beer
romantic
manages
creative
kid
to_keep
tragedy
skills
in_which
window
worthy
brothers
even_more
to_earth
to_mention
rip
body
acceptable
ring
haunted
era
leave
throwing
in_right
movie_br
performances_by
basic
that_but
these_things
normal
fate
taking
out_to_be
to_war
to_like
think_about
first_two
monkey
ratio
feet
humour
course_in
lost_interest
engage
master
showing
how_about
compare_to
gentle
surface
reviews
in_real
giant
film_made
wall
don
voodoo
slowly
victim
delivering
to_understand
murdered
months
br_br_in_fact
absurd
ready
working
use
sides
but_film
theaters
to_go
mostly
as_much_as
highlight
length
something_like
miscast_as
to_any
scientists
pain
sorry_to
paris
in_book
follow
little_bit
no_better
under
getting
fbi
with_another
could_easily
mainstream
given
in_post
terror
br_br_most
pace
note
bad_but
fair
along_with
involved
ass
came_to
first_movie
among_other
situation
desperate
seems_like
compare
grave
party
you've
movie_all
